wsdl/vucem/COVE/edocument/ConsultaAcusesServiceWS.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><definitions xmlns:wssutil="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.ventanillaunica.gob.mx/ws/consulta/acuses/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.ventanillaunica.gob.mx/ws/consulta/acuses/" name="ConsultaAcusesServiceWS">
<wsp:UsingPolicy wssutil:Required="true"/>
<wsp:Policy wssutil:Id="Mtom.xml">
<ns1:OptimizedMimeSerialization xmlns:ns1="http://schemas.xmlsoap.org/ws/2004/09/policy/optimizedmimeserialization"/>
</wsp:Policy>
<wsp:Policy wssutil:Id="Wssp1.2-Https-UsernameToken-Plain.xml">
<ns2:TransportBinding xmlns:ns2="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200512">
<wsp:Policy>
<ns2:TransportToken>
<wsp:Policy>
<ns2:HttpsToken/>
</wsp:Policy>
</ns2:TransportToken>
<ns2:AlgorithmSuite>
<wsp:Policy>
<ns2:Basic256/>
</wsp:Policy>
</ns2:AlgorithmSuite>
<ns2:Layout>
<wsp:Policy>
<ns2:Lax/>
</wsp:Policy>
</ns2:Layout>
<ns2:IncludeTimestamp/>
</wsp:Policy>
</ns2:TransportBinding>
<ns3:SupportingTokens xmlns:ns3="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200512">
<wsp:Policy>
<ns3:UsernameToken ns3:IncludeToken="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200512/IncludeToken/AlwaysToRecipient">
<wsp:Policy>
<ns3:WssUsernameToken10/>
</wsp:Policy>
</ns3:UsernameToken>
</wsp:Policy>
</ns3:SupportingTokens>
</wsp:Policy>
<types>
<xsd:schema>
<xsd:import namespace="http://www.ventanillaunica.gob.mx/ws/consulta/acuses/" schemaLocation="https://www.ventanillaunica.gob.mx:443/ventanilla-acuses-HA/ConsultaAcusesServiceWS?xsd=1"/>
</xsd:schema>
<xsd:schema>
<xsd:import namespace="http://www.ventanillaunica.gob.mx/consulta/acuses/oxml" schemaLocation="https://www.ventanillaunica.gob.mx:443/ventanilla-acuses-HA/ConsultaAcusesServiceWS?xsd=2"/>
</xsd:schema>
</types>
<message name="consultarAcuseEdocument">
<part xmlns:ns4="http://www.ventanillaunica.gob.mx/consulta/acuses/oxml" name="peticion" element="ns4:consultaAcusesPeticion"/>
</message>
<message name="consultarAcuseEdocumentResponse">
<part name="respuesta" element="tns:responseConsultaAcuses"/>
</message>
<message name="consultarAcuseCove">
<part xmlns:ns5="http://www.ventanillaunica.gob.mx/consulta/acuses/oxml" name="peticion" element="ns5:consultaAcusesPeticion"/>
</message>
<message name="consultarAcuseCoveResponse">
<part name="respuesta" element="tns:responseConsultaAcuses"/>
</message>
<portType name="ConsultaAcusesServiceWS">
<operation name="consultarAcuseEdocument">
<input message="tns:consultarAcuseEdocument"/>
<output message="tns:consultarAcuseEdocumentResponse"/>
</operation>
<operation name="consultarAcuseCove">
<input message="tns:consultarAcuseCove"/>
<output message="tns:consultarAcuseCoveResponse"/>
</operation>
</portType>
<binding name="ConsultaAcusesServiceWSEndPointBinding" type="tns:ConsultaAcusesServiceWS">
<wsp:PolicyReference URI="#Mtom.xml"/>
<wsp:PolicyReference URI="#Wssp1.2-Https-UsernameToken-Plain.xml"/>
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="consultarAcuseEdocument">
<soap:operation soapAction="http://www.ventanillaunica.gob.mx/ventanilla/ConsultaAcusesService/consultarAcuseEdocument"/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="consultarAcuseCove">
<soap:operation soapAction="http://www.ventanillaunica.gob.mx/ventanilla/ConsultaAcusesService/consultarAcuseCove"/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="ConsultaAcusesServiceWS">
<port name="ConsultaAcusesServiceWSEndPoint" binding="tns:ConsultaAcusesServiceWSEndPointBinding">
<soap:address location="https://www.ventanillaunica.gob.mx:8107/ventanilla-acuses-HA/ConsultaAcusesServiceWS"/>
</port>
</service>
</definitions>