ventanilla_unica_Web_servicec_scraping/payload_structure/templates/consultar_acuses.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
   xmlns:oxml="http://www.ventanillaunica.gob.mx/consulta/acuses/oxml">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken>
            <wsse:Username>{username}</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{password}</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <oxml:consultaAcusesPeticion>
         <idEdocument>{id_edocument}</idEdocument>
      </oxml:consultaAcusesPeticion>
   </soapenv:Body>
</soapenv:Envelope>
